Revit 2024 API
DirectShapeType.AreValidDirectShapeReferenceOptions Method
 Validates that the input DirectShapeReferenceOptions are suitable for creating a direct shape reference object. If the options specify an ExternalGeometryId, it must not correspond to any existing reference object belonging to the DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool AreValidDirectShapeReferenceOptions(
	DirectShapeReferenceOptions options
)
Visual Basic
Public Function AreValidDirectShapeReferenceOptions ( _
	options As DirectShapeReferenceOptions _
) As Boolean
Visual C++
public:
bool AreValidDirectShapeReferenceOptions(
	DirectShapeReferenceOptions^ options
)
Parameters
options
Type: Autodesk.Revit.DB.DirectShapeReferenceOptions
 The options to test.
Return Value
 True if the options can be used to add a reference object to this DirectShapeType.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace